alex-roos-website.org
#+TITLE: Alex Roos Work Website
#+STARTUP: content
# #+HUGO_BASE_DIR: /sshx:tipxmr:/home/tipxmr/alex-roos/
#+HUGO_BASE_DIR: /home/alex/Coding/alex-roos/
# #+HUGO_AUTO_SET_LASTMOD: t
#+AUTHOR: Alex Roos

** DONE ReputationBot
:PROPERTIES:
:EXPORT_FILE_NAME: ReputationBot
:EXPORT_HUGO_SECTION: projects
:EXPORT_HUGO_TAGS: python sql telegram sqlalchemy
:EXPORT_HUGO_PUBLISHDATE: 2021-03-01
:END:
> [[https://github.com/AlexRoosWork/reputation-bot][Check the code out on GitHub!]]
*** My first real telegram bot
Since I was an admin in a particular Telegram group, I wanted to use my programming knowledge to expand the utility of my group. Soon after, the idea for a Reddit-style voting bot for messages was born.

Basically, users have voting power that gets reset every 24 hours. Up- or downvoting consumes voting power. Users collect repuation over time and can "win the week", meaning that they are the user with the most upvotes in a given week. For every week championship a trophy emoji ðŸ† is added to their reputation.

There are a couple more mechanisms, like leveling up. However, the goal was to incentivise the group members to post high quality content.
*** Tying it all together
With this programm I did my first steps with the [[https://python-telegram-bot.readthedocs.io/en/stable/][python-telegram-bot]] module. I experienced a steep learning curve and was also able to use my knowledge of SQLAlchemy to administer the database.
